// 34个省、市、自治区的名字拼音映射数组
export const PROVINCES = [
    // 23个省
    '台湾省',
    '河北省',
    '山西省',
    '辽宁省',
    '吉林省',
    '黑龙江省',
    '江苏省',
    '浙江省',
    '安徽省',
    '福建省',
    '江西省',
    '山东省',
    '河南省',
    '湖北省',
    '湖南省',
    '广东省',
    '海南省',
    '四川省',
    '贵州省',
    '云南省',
    '陕西省',
    '甘肃省',
    '青海省',
    // 5个自治区
    '新疆维吾尔自治区',
    '广西壮族自治区',
    '内蒙古自治区',
    '宁夏回族自治区',
    '西藏自治区',
    // 4个直辖市
    '北京市',
    '天津市',
    '上海市',
    '重庆市',
    // 2个特别行政区
    '香港',
    '澳门'
]
// 直辖市和特别行政区-只有二级地图，没有三级地图
export const SPECIALPROVINCES = [
    '北京市',
    '天津市',
    '上海市',
    '重庆市',
    '香港',
    '澳门',
    '台湾'
]
// 点击县级区域，其 seriesName 格式为 '省级-市级'，无法下钻四级地图
export const COUNTY = [
    '河北-',
    '山西-',
    '辽宁-',
    '吉林-',
    '黑龙江-',
    '江苏-',
    '浙江-',
    '安徽-',
    '福建-',
    '江西-',
    '山东-',
    '河南-',
    '湖北-',
    '湖南-',
    '广东-',
    '海南-',
    '四川-',
    '贵州-',
    '云南-',
    '陕西-',
    '甘肃-',
    '青海-',
    '新疆-',
    '广西-',
    '内蒙古-',
    '宁夏-',
    '西藏-'
]
